Белгипрозем_2017/src/Documents/ОплатаРабот/ОплатаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаРабот</name>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПлатежногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

Белгипрозем_2017/src/Documents/ОплатаРабот/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.ОплатаРабот.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗапасыСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);

	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Если ДополнительныеСвойства.Свойство("Загрузка") Тогда
	    Возврат;
	КонецЕсли; 
	
    // Запись Даты оплаты этапа договора
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДатыДоговоров;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ЭтапДоговора", Таблица[0].ЭтапДоговора);
	СтруктураОтбора.Вставить("ВидДатыДоговора", Таблица[0].ВидДатыДоговора);
	
	мРаботаСДоговорами.ЗаписатьДатуДоговора(Таблица, СтруктураОтбора, Отказ);
	
    // Запись Планового срока этапа договора
	ПлановыйСрок = мРаботаСДоговорами.РассчитатьПлановыйСрокВыполненияДоговора(Таблица[0].ЭтапДоговора, Таблица[0].Дата, Истина);
        Если ПлановыйСрок <> Неопределено Тогда
		 //Если ПлановыйСрок <> Дата(1,1,1) Тогда
		ТабДляДаты = Таблица.Скопировать();
		ТабДляДаты.Очистить();
		
		НоваяСтрока = ТабДляДаты.Добавить();
        НоваяСтрока.Период = ТекущаяДата();
		//НоваяСтрока.Период = Таблица[0].Период;
		НоваяСтрока.Дата = ПлановыйСрок;
		НоваяСтрока.Ссылка = Таблица[0].Ссылка;
		НоваяСтрока.Корреспондент = Таблица[0].Корреспондент;
		НоваяСтрока.Договор = Таблица[0].Договор;
		НоваяСтрока.ЭтапДоговора = Таблица[0].ЭтапДоговора;
		НоваяСтрока.Основание = Таблица[0].Основание;
		НоваяСтрока.Установил = Таблица[0].Установил;
		НоваяСтрока.ВидДатыДоговора = Справочники.мВидыДатДоговоров.ПлановыйСрок;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЭтапДоговора", Таблица[0].ЭтапДоговора);
		СтруктураОтбора.Вставить("ВидДатыДоговора", Справочники.мВидыДатДоговоров.ПлановыйСрок);
		
		мРаботаСДоговорами.ЗаписатьДатуДоговора(ТабДляДаты, СтруктураОтбора, Отказ);
	КонецЕсли; 
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Удаление даты договора
	мРаботаСДоговорами.УдалитьДатуДоговора(Ссылка, Отказ);
КонецПроцедуры
